kirikak2/midori/sdkconfig.defaults.m5stack_tab5
# M5Stack Tab5 specific settings (ESP32-P4)
#
# Board settings only. The USB-C port mode (USB serial / USB-MIDI device)
# lives in sdkconfig.defaults.usbmode.*, which switch_board.sh appends to
# this file. The USB-A host port is always available on Tab5.
CONFIG_USB_MIDI_BOARD_M5STACK_TAB5=y

# Target: ESP32-P4 (RISC-V dual-core 400MHz)
CONFIG_IDF_TARGET="esp32p4"

# Enable experimental features (required for 200MHz PSRAM)
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# ESP32-P4 minimum chip revision (early silicon).
# The Tab5's ESP32-P4 is Rev v1.3. ESP-IDF v5.5.5 raised the default minimum
# to Rev v3.1, which is a different, INCOMPATIBLE silicon family and rejects
# v1.x hardware at flash time ("requires chip revision v3.1-v3.99"). Opt into
# pre-v3 support and pin the minimum to Rev v1.0 so v1.3 boots.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Custom partition table
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM configuration for Tab5 (32MB PSRAM in Hex mode)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
# PSRAM speed MUST be 200MHz for Tab5 display (1280x720)
# CONFIG_SPIRAM_SPEED_80M is not set
# CONFIG_SPIRAM_SPEED_20M is not set
CONFIG_SPIRAM_SPEED_200M=y

# Use PSRAM for memory allocation
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=16384
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Compiler optimization for size
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# USB Host settings for USB-A port (MIDI host)
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=4096

# USB Host power management
# Disable USB suspend to prevent disconnection issues
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y

# Tab5 display settings (1280x720, landscape mode)
# Font size 3 for better readability on high-DPI 5-inch screen
CONFIG_USB_MIDI_LCD_FONT_SIZE=4
CONFIG_USB_MIDI_LCD_BACKLIGHT_LEVEL=200

# Use the full 16MB flash (Tab5 hardware). Needed for the coredump
# partition which sits beyond the first 2MB.
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Save a core dump to flash on panic. In USB-MIDI device mode the console
# runs over TinyUSB CDC, which dies together with a crash, so on-console
# panic output is not reliable on Tab5. Retrieve after reboot with:
#   idf.py coredump-info   (device in download mode: BOOT + RESET)
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y

# Enable mbedtls CMAC support for PicoRuby
CONFIG_MBEDTLS_CMAC_C=y

# Brownout detection level
# Level 5 (2.66V) - lowest level to prevent false triggers during USB operation
# Tab5 with USB-A host can cause significant voltage drops under load
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7 is not set
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_6 is not set
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5=y
CONFIG_ESP_BROWNOUT_DET_LVL=5

